### **Ejercicio 1: Limpiar y transformar columnas de texto**
Dado el siguiente DataFrame de productos:

In [2]:
import pandas as pd

data = {
    'Producto': ['Café', 'té', ' chocolate', ' Cacao '],
    'Precio': [100, 80, 150, 120],
    'Categoría': ['bebidas calientes', 'bebidas calientes', 'snacks dulces', ' bebidas calientes ']
}

df_productos = pd.DataFrame(data)

1. Elimina los espacios en blanco de las columnas **Producto**.
2. Convierte todos los valores de la columna **Categoría** a mayúsculas.
3. Reemplaza la categoría 'snacks dulces' por 'postres'.
4. Crea una nueva columna que indique si el precio es mayor o igual a 120. Usa una función `lambda` para esto.

In [25]:
df_productos['Producto'] = df_productos['Producto'].str.replace(" ","")
df_productos['Categoría'] = df_productos['Categoría'].str.upper()
df_productos['Categoría'] = df_productos['Categoría'].str.replace("SNACKS DULCES","POSTRES")
df_productos['Mayor120'] = df_productos['Precio'].apply(lambda x: x > 120,"Sí")

df_productos

C:\Users\Edinson\AppData\Local\Temp\ipykernel_25940\2525191405.py:4: FutureWarning: the convert_dtype parameter is deprecated and will be removed in a future version.  Do ``ser.astype(object).apply()`` instead if you want ``convert_dtype=False``.
  df_productos['Mayor120'] = df_productos['Precio'].apply(lambda x: x > 120,"a")

    Producto  Precio            Categoría  Mayor120
0       Café     100    BEBIDAS CALIENTES     False
1         té      80    BEBIDAS CALIENTES     False
2  chocolate     150              POSTRES      True
3      Cacao     120   BEBIDAS CALIENTES      False

### **Ejercicio 2: Limpieza de duplicados y manejo de datos faltantes**
Dado el siguiente DataFrame de empleados:

In [54]:
data_empleados = {
    'Nombre': ['Ana', 'Luis', 'Pedro', 'Luis', 'Juan', 'Ana'],
    'Edad': [29, 45, None, 40, 35, 29],
    'Departamento': ['Ventas', 'Finanzas', 'RRHH', 'Finanzas', 'Marketing', None]
}

df_empleados = pd.DataFrame(data_empleados)
df_empleados

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
1   Luis  45.0     Finanzas
2  Pedro   NaN         RRHH
3   Luis  40.0     Finanzas
4   Juan  35.0    Marketing
5    Ana  29.0         None

1. Elimina las filas duplicadas en base a la columna **Nombre**. Quédate con la persona `más joven´.
2. Llena los valores faltantes de la columna **Edad** con la media de las edades.
3. Llena los valores faltantes de la columna **Departamento** con el valor 'Desconocido'.
4. Ordena el DataFrame por edad de forma descendente.

In [60]:
df_empleados.sort_values('Edad',ascending=False,inplace=True)
df_empleados.drop_duplicates('Nombre',inplace=True,keep='last')
df_empleados['Departamento'] = df_empleados['Departamento'].fillna("Desconocido")
df_empleados.sort_values('Edad',ascending=False,inplace=True)
df_empleados

  Nombre       Edad Departamento
3   Luis  40.000000     Finanzas
4   Juan  35.000000    Marketing
2  Pedro  34.666667         RRHH
5    Ana  29.000000  Desconocido

In [59]:
edad_media = df_empleados['Edad'].mean()
df_empleados['Edad'] = df_empleados['Precio'].fillna(edad_media)
df_empleados

  Nombre       Edad Departamento
3   Luis  40.000000     Finanzas
4   Juan  35.000000    Marketing
5    Ana  29.000000         None
2  Pedro  34.666667         RRHH

### **Ejercicio 3: Aplicar funciones a las columnas**
Dado un DataFrame de ventas de productos:

In [49]:
data_ventas = {
    'Producto': ['Café', 'Té', 'Jugo', 'Agua'],
    'Precio': [120, 80, 90, 60],
    'Cantidad': [3, 5, 2, 8]
}

df_ventas = pd.DataFrame(data_ventas)

1. Calcula el total de ventas (Precio * Cantidad) y agrégalo como una nueva columna.
2. Crea una nueva columna llamada **Descuento** que aplique un descuento del 10% si el precio es mayor a 100, y del 5% si es menor o igual a 100. Usa la función `apply` y una función `lambda`.

In [71]:
df_ventas['TotalVentas'] = df_ventas['Precio'] * df_ventas["Cantidad"]
df_ventas['Descuento'] = df_ventas['Precio'].apply(lambda x: x >= 100, "a")
#df_ventas['Descuento'] = df_ventas['Precio'].apply(lambda x: x >= 100, df_ventas['Precio']*1.10,df_ventas['Precio']*1.05)
#df_productos['Mayor120'] = df_productos['Precio'].apply(lambda x: x > 120,"Sí")

df_ventas

C:\Users\Edinson\AppData\Local\Temp\ipykernel_25940\1931092650.py:2: FutureWarning: the convert_dtype parameter is deprecated and will be removed in a future version.  Do ``ser.astype(object).apply()`` instead if you want ``convert_dtype=False``.
  df_ventas['Descuento'] = df_ventas['Precio'].apply(lambda x: x >= 100, "a")

  Producto  Precio  Cantidad  TotalVentas  Descuento
0     Café     120         3          360       True
1       Té      80         5          400      False
2     Jugo      90         2          180      False
3     Agua      60         8          480      False

### **Ejercicio 4: Uso de funciones de cadena**
Dado el siguiente DataFrame de direcciones de clientes:

In [4]:
data_clientes = {
    'Cliente': ['Juan Pérez', 'Ana Ruiz', 'Pedro López'],
    'Dirección': ['calle falsa 123', 'Calle PRINCIPAL 45', 'AV. LOS robles 34']
}

df_clientes = pd.DataFrame(data_clientes)

1. Convierte todos los valores de la columna **Dirección** a minúsculas.
2. Reemplaza las abreviaturas "calle", "av." por "calle" y "avenida" respectivamente.
3. Extrae el número de la dirección y guárdalo en una nueva columna llamada **Número**.